### **Data Cleaning and Exploratory Analysis**

#### **Import libraries**

In [51]:
# Import the custom function 'gera_dados' from the local module 'gerar_dados_aleatorios'
from modules.generae_random_sales_data import GenerateData as gd

# Import date and time utilities for handling timestamps and time intervals
from datetime import datetime, timedelta

# Import data visualization libraries
import matplotlib.pyplot as plt
import seaborn as sns

# Import data manipulation and numerical computation libraries
import pandas as pd
import numpy as np

# Import the 'random' module for generating random numbers
import random

#### **Create functions**

In [52]:
# Function to format numeric values into millions with the Brazilian Real currency symbol
# Example: 3_500_000 -> 'R$ 3.50 Mi'
def format_millions(y, pos):
    return f'R$ {y / 1_000_000:.2f} Mi'

In [53]:
# Function to format percentage labels for charts (e.g., pie charts)
# Displays both the percentage and the corresponding absolute value in millions
# Example: 25% -> '25%\nR$ 2.50 Mi'
def format_percentage_labels(pct, all_values):
    absolute = pct / 100.0 * sum(all_values)
    return f'{pct:.1f}%\nR$ {absolute / 1_000_000:.2f} Mi'

In [54]:
# Function to format a numeric value as Brazilian Real currency
# Example: 1234567.89 -> 'R$ 1,234,567.89'
def format_brl(value):
    return f'R$ {value:,.2f}'

#### **Create a random dataset**

In [55]:
# Create a random dataFrame
df_sales = gd.generate_fake_data()

Starting the generation of 600 records...
Data generation completed successfully.

#### **Exploratory Data Analysis**

In [56]:
# Check the first 5 records
df_sales.head()

,Order_ID,Order_Date,Product_Name,Category,Unit_Price,Quantity,Customer_ID,City,State
0,1000,2026-01-01 06:00:00,SSD 1TB,Hardware,600.0,5,149,Salvador,BA
1,1001,2026-01-01 19:00:00,Gaming Chair,Furniture,1200.0,2,112,Fortaleza,CE
2,1002,2026-01-01 08:00:00,Headset 7.1,Accessories,800.0,4,139,Belo Horizonte,MG
3,1003,2026-01-01 17:00:00,SSD 1TB,Hardware,600.0,5,146,Rio de Janeiro,RJ
4,1004,2026-01-01 14:00:00,Gaming Chair,Furniture,1200.0,1,120,Fortaleza,CE

In [57]:
# Show how much lines and coluns the DataFrame has
df_sales.shape

(600, 9)

In [58]:
# Show important information (null, data type)
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order_ID      600 non-null    int64
 1   Order_Date    600 non-null    datetime64[ns]
 2   Product_Name  600 non-null    object
 3   Category      600 non-null    object
 4   Unit_Price    600 non-null    float64
 5   Quantity      600 non-null    int64
 6   Customer_ID   600 non-null    int64
 7   City          600 non-null    object
 8   State         600 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(3), object(4)
memory usage: 42.3+ KB

In [59]:
# Show statistics summary (mantain just important columns)
df_sales[['Unit_Price', 'Quantity']].describe()

        Unit_Price    Quantity
count   600.000000  600.000000
mean   2267.169517    3.955000
std    2413.477577    1.999075
min     225.340000    1.000000
25%     600.000000    2.000000
50%     800.000000    4.000000
75%    2800.000000    6.000000
max    7500.000000    7.000000

In [60]:
# Show duplicate values
df_sales.duplicated().sum()

np.int64(0)

In [61]:
# Convert date columns to datetime type
df_sales['Order_Date'] = pd.to_datetime(df_sales['Order_Date'])

### **Addressing business-related questions**

#### What are the top 10 best-selling products?

In [62]:
# Groups the sales data by product name and sums up the total quantity sold for each product
top_10_products_by_quantity = df_sales.groupby(
    'Product_Name'
)['Quantity'].sum().sort_values(ascending = False)

In [63]:
# Converts the result into a DataFrame for easier visualization and analysis
pd.DataFrame(top_10_products_by_quantity)

                     Quantity
Product_Name
SSD 1TB                   350
Graphics Card             314
Headset 7.1               307
Gaming Laptop             294
Gaming Chair              285
Ultrawide Monitor         282
Vertical Mouse            273
Mechanical Keyboard       268

#### What was the revenue for the month?

In [64]:
# Create a month/year column at the DataFrame
df_sales['Month_Year'] = df_sales['Order_Date'].dt.strftime('%b-%Y')

In [65]:
# Create a column containing the revenue amount
df_sales['Revenue_Amount'] =  df_sales['Unit_Price'] * df_sales['Quantity']

In [66]:
# Group the sales data by month-year and sums up the total revenue amount
total_revenu_by_month =  df_sales.groupby('Month_Year')['Revenue_Amount'].sum().sort_values(ascending = False)

In [69]:
# Converts the result into a DataFrame for easier visualization and analysis
df_display = pd.DataFrame(total_revenu_by_month)

df_display['Revenue_Amount'] = df_display['Revenue_Amount'].apply(format_brl)

df_display

             Revenue_Amount
Month_Year
Jan-2026    R$ 1,413,961.31
Apr-2026    R$ 1,411,067.94
Feb-2026    R$ 1,311,767.91
Mar-2026    R$ 1,273,678.57